web/blog/r223/app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
---
  def index
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 3))
---
  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 3))
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2012-05-09 03:34:49.098239', E'is body ', '2012-05-09 03:34:49.098239', 3, E'commer') RETURNING "id"
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy