web/blog/r223/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    # logger send message
    logger.debug "New post: #{@post.attributes.inspect}"
    logger.debug "Post should be vaild: #{@post.valid?}"
    #logger.info
    #logger.fatal

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES(E'', '2012-05-07 07:52:01.591970', E'', '2012-05-07 07:52:01.591970', E'') RETURNING "id"

  def destroy
    #@post = Post.find(params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "id" = 1

  def find_post
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3)